//***************************************************************************************
//烈火微型四轴飞行器源码版权归烈火团队所有，未经烈火团队同意，请勿随意在网上传播本源码。
//与本软件相关书籍<<四轴飞行器DIY-基于STM32微控制器>>，由北航出版社正式出版，内容对本套包
//含的所有软件以及硬件相关都做了详细的讲解，有兴趣的网友可以从各大书店购买。
//与本软件配套的硬件：http://fire-dragon.taobao.com
//如果有网友做了各种有意义的改进，请随时与我们保持联系。
//QQ：16053729    烈火QQ群：234879071
//***************************************************************************************
#include "tasks.h"
#include "pid.h"
#include "protocol.h"

extern u8 RS485_RX_BUF[64]; 
extern u8 RS485_TX_BUF[64];
extern uint32_t Timer4_Count;
/******************************************************************************
函数原型：	void Task_1000HZ(void)
功    能：	主循环中运行频率为1000HZ任务
*******************************************************************************/ 
void OnResetFlowDown(void)
{
}
void Task_1000HZ(void)
{
		u8 len;
	  Debug4_H;				
		RS485_Receive_Data(RS485_RX_BUF,&len);
		if(len)
		{
			 parseData(RS485_RX_BUF,len);
 		}
	 Debug4_L;
}

/******************************************************************************
函数原型：	void Task_500HZ(void)
功    能：	主循环中运行频率为500HZ任务
*******************************************************************************/ 
void Task_500HZ(void)
{
	Debug2_H;
	if (isPIDEnable()) PIDStart();
	Debug2_L;
}

/******************************************************************************
函数原型：	void Task_250HZ(void)
功    能：	主循环中运行频率为250HZ任务
*******************************************************************************/ 
void Task_250HZ(void)
{
	Debug3_H;
	if(IsFlowReset()){
			LED_ON_OFF();
			OnResetFlowDown();
	  }
	Debug3_L;
}
			
